import { useState } from "react";
import { createContext, useContext } from "react";

const GlobalContext = createContext();

export function GlobalProvider({ children }) {
  const [value, setvalue] = useState('')

  const musicdata = [
    {
      name: 'ماندگار',
      musicNumber: '1',
      imageNumber: '1',
      musicText: `
        باشه هرچی که تو میخوای
        هرچی باشه می پذیرم
        دست تو بزار رو قلبم
        بگو جونتو نمی رم
        باشه هرچی که تو میخوای

        اگه پای تو قراره پاروی دنیا بزارم
        باشه من حرفی ندارم
        حاضرم درد تو با عشق به تن و جونم بگیرم
        پای این عشق بزار بمیرم رسانه آهنگ

        نمی زارم این درد و رو شونه هام بزاری بری
        نمی زارم این بغض و رو گونه هام بباری بری
        تو که غیر آغوش من خونه ای نداری بری
        نزا با دل کندن ته دنیای من اینجوری تموم شه
        واسه من کاری کن نذا روی من اینجوری حروم شه

        دست تو بزار رو قلبم که اگه دل کندم
        از تو روزگاری قلبمو به روم بیاری
        که بدونی چه بمونی چه نمونی موندگاری

        نمی زارم این درد و رو شونه هام بزاری بری
        نمی زارم این بغض و رو گونه هام بباری بری
        تو که غیر آغوش من خونه ای نداری بری
        نزا با دل کندن ته دنیای من اینجوری تموم شه
        واسه من کاری کن نذا روی من اینجوری حروم شه
      `,
      singrName: 'معین',
      category: 'سنتی',
      releaseDate: '۲  ⁄  ۱۲  ⁄  ۱۳۹۹'
    },
    {
      name: 'آخرین آهنگ',
      musicNumber: '2',
      imageNumber: '2',
      musicText: `
        اگه این آخرین شعره اگه این آخرین آهنگ

        بازم میخونم از شوق یه دنیای بدون جنگ

        اگه این آخرین راهه اگه این آخرین پرده

        منو با بوسه ای بسپار به یه دنیای بی برده

        واسه تو باقی میذارم نهال سبز رویامو

        امید با تو برگشتن به شهر آرزوهامو

        واسه تو باقی میذارم جای خالیمو توو رگبار

        نگاه بی قرارم رو توو عکس قاب رو دیوار

        منو گم کن توو آغوشت که نامیرا بشم با تو

        بنوشم جرعه به جرعه بهار تووی چشماتو

        صدام میمونه بعد از من بازم دستاتو میگیرم

        تو اونقدر زندگیم بودی که با مرگم نمیمیرم

        اگه این آخرین برگه اگه این فصل پاییزه

        شریک این شرابی باش که توو گیلاس و میریزه

        اگه این آخرین لحظه اگه این آخرین روزه

        بذار اون جنگلی باشم که مغروره و نمیسوزه

        همه روزای تبعیدو کنار تو سفر کردم

        پناه لحظه هام بودی من از تو برنمیگردم

        چشات معنای آرامش نگاهت سرزمینم بود

        همیشه مومنت بودم که لبخند تو دینم بود

        منو گم کن توو آغوشت که نامیرا بشم با تو

        بنوشم جرعه به جرعه بهار تووی چشماتو

        صدام میمونه بعد از من بازم دستاتو میگیرم

        تو اونقدر زندگیم بودی که با مرگم نمیمیرم
      `,
      singrName: 'ابی',
      category: 'سنتی',
      releaseDate: '۲۱  ⁄  ۹  ⁄  ۱۳۹۸'
    },
    {
      name: 'همه رفتند',
      musicNumber: '3',
      imageNumber: '3',
      musicText: `
        متن آهنگ همه رفتند رضا بهرام
        همه رفتند تا زمستان شد
        خنده ها مردند گریه ارزان شد
        کو جوانی آرزو ها کو
        رفته ایم از یاد یادی از ما کو
        شاید این بغض آخرم باشد آخرین غمم باشد
        عاشقانه ای آرام بین درد و غم باشد
        هر آشنایی غریبه است هر نگاهی فریب است
        با صدای هر باران حال قلبم عجیب است
        غم تقدیر هم قطار درد ما شده
        دریا شبیه بغض ما شده
        از ما چه مانده غیر از آرزو
        با قلب خسته ای خدا بگو
        دنیای ما کو دل تنهای ما کو رویای ما کو
        دنیای ما کو فردای ما کو
        ای ساحل غم دریای ما کو
        ای قاضی عشق در بازی عشق
        پس جای ما کو ...
        همه رفتند تا زمستان شد
        خنده ها مردند گریه ارزان شد
        کو جوانی آرزو ها کو
        رفته ایم از یاد یادی از ما کو
        شاید این بغض آخرم باشد آخرین غمم باشد
        عاشقانه ای آرام بین درد و غم باشد
        هر آشنایی غریبه است هر نگاهی فریب است
        با صدای هر باران حال قلبم عجیب است
      `,
      singrName: 'رضا بهرام',
      category: 'غمگین',
      releaseDate: '۱۰  ⁄  ۱۱  ⁄  ۱۴۰۲'
    },
    {
      name: 'سنگ خارا',
      musicNumber: '4',
      imageNumber: '4',
      musicText: `
        جای آن دارد که چندی هم ره صحرا بگیرم
        سنگ خارا را گواه این دل شیدا بگیرم
        مو به مو دارم سخنها نکته ها از انجمنها
        بشنو ای سنگ بیابان بشنوید ای باد و باران
        با شما همرازم اکنون با شما دمسازم اکنون
        دانلود آهنگ سنگ خارا با صدای معین

        شمع خودسوزی چو من در میان انجمن
        گاهی اگر آهی کشد دلها بسوزد
        گاهی اگر آهی کشد دلها بسوزد
        یک چنین آتش به جان مصلحت باشد همان
        با عشق خود تنها شود تنها بسوزد
        با عشق خود تنها شود تنها بسوزد

        من یکی مجنون دیگر در پی لیلای خویشم
        عاشق این شور و حال عشق بی پروای خویشم
        تا به سویش ره سپارم سر ز مستی برندارم
        من پریشان حال و دلخوش با همین دنیای خویشم

        جای آن دارد که چندی هم ره صحرا بگیرم
        سنگ خارا را گواه این دل شیدا بگیرم
        مو به مو دارم سخنها نکته ها از انجمنها
        بشنو ای سنگ بیابان بشنوید ای باد و باران
        با شما همرازم اکنون با شما دمسازم اکنون
      `,
      singrName: 'معین',
      category: 'سنتی',
      releaseDate: '۱۰  ⁄  ۱۱  ⁄  ۱۳۹۶'
    },
    {
      name: 'شب و بارون',
      musicNumber: '5',
      imageNumber: '5',
      musicText: `
        ممیترسم تنهاشم بدون نگات دوباره

        کاش بگی تا ابد عشقمون ادامه داره

        هیجان تو داره منو از پا در میاره

        شوق تو قلبم رو داره از جا در میاره

        بازم شب و بارون میزنم بیرون تو خیابونا

        حیرون و سرگردون عاشق و ویرون زیر بارونا

        بازم شب و بارون میزنم بیرون تو خیابونا

        حیرون و سرگردون عاشق و ویرون زیر بارونا طولانی میخوامت اگه روزگار بزاره

        میترسم خوشبختی واسه ما دووم نیاره

        دل من بجز تو با همه ناسازگاره

        طولانی میخوامت اگه روزگار بزاره

        داشتنت بهترین اتفاق روزگاره

        تا دلت بخواد من تورو میخوام

        بگو تا کجا دنبالت بیام

        درگیر چشمای توئه تموم دنیا

        نگاتو نگیری از نگام بیا تا برن تنهاییام

        بمون منم که بی تو دنیا رو نمیخوام

        بازم شب و بارون میزنم بیرون تو خیابونا

        حیرون و سرگردون عاشق و ویرون زیر بارونا
        
        بازم شب و بارون میزنم بیرون تو خیابونا

        حیرون و سرگردون عاشق و ویرون زیر بارونا
      `,
      singrName: 'شهرام شکوهی',
      category: 'شاد',
      releaseDate: '۲۷  ⁄  ۱  ⁄  ۱۳۹۸'
    },
    {
      name: 'نماز',
      musicNumber: '6',
      imageNumber: '6',
      musicText: `
        نماز مغربو امشب به نام عشق برپا کن
        الله اکبر الله اکبر …

        نماز مغربو امشب به نام عشق برپا کن
        واسم از درگه حق مهربونیتو تمنا کن
        بخواه عشقو از اون قادر که هر ناگفته میدونه
        که هر ناخونده میخونه
        هوا اونه صدا اونه خدای عاشقا اونه
        هوا اونه صدا اونه خدای عاشقا اونه …
        دانلود آهنگ نماز با صدای معین

        از امشب تا نماز مغرب هر شب
        کنارم باش و یارم باش و با من ، با من عاشق مدارا کن
        بگو یا رب منو رسوای رسوا کن
        توو قلبم آتش افروزان و غوغا کن
        هوا اونه صدا اونه خدای عاشقا اونه
        هوا اونه صدا اونه خدای عاشقا اونه …

        اگه عشق منی …
        اگه عشق منی امشب نمازو همصدا با قلب من
        امشب نمازو همصدا با قلب من ذکر خدایا کن
        الهی …
        هوا اونه صدا اونه خدای عاشقا اونه
        هوا اونه صدا اونه خدای عاشقا اونه …
      `,
      singrName: 'معین',
      category: 'نوستاژیک',
      releaseDate: '۲۳  ⁄  ۳  ⁄  ۱۳۷۱'
    },
    {
      name: 'صبحت بخیر عزیزم',
      musicNumber: '8',
      imageNumber: '8',
      musicText: `
        صبحت بخیر عزیزم با آنکه گفته بودی

        دیشب خدانگهدار

        با آنکه دست سردت از قلب خسته تو

        گوید حدیث بسیار

        صبحت بخیر عزیزم با آنکه در نگاهت

        حرفی برای من نیست

        با آنکه لحظه، لحظه میخوانم از دو چشمت

        تن خسته ای ز تکرار

        در جان عاشق من شوق جدا شدن نیست

        خو کرده ی قفس را میل رها شدن نیست

        من با تمام جانم پر بسته و اسیرم

        باید که با تو باشم در پای تو بمیرم

        دانلود آهنگ معین صبحت بخیر عزیزم

        صبحت بخیر عزیزم با آنکه گفته بودی

        دیشب خدانگهدار

        با آنکه دست سردت از قلب خسته تو

        گوید حدیث بسیار

        صبحت بخیر عزیزم با آنکه در نگاهت

        حرفی برای من نیست

        با آنکه لحظه لحظه میخوانم از دو چشمت

        تن خسته ای ز تکرار

        این بار غصه ها رو از دوش خسته بردار

        من کوه استوارم به من بگو نگه دار

        عهدی که با تو بستم هرگز شکستنی نیست

        این رشته تا دم مرگ هرگز گسستنی نیست

        صبحت بخیر عزیزم با آنکه گفته بودی

        دیشب خدانگهدار

        با آنکه دست سردت از قلب خسته تو

        گوید حدیث بسیار

        صبحت بخیر عزیزم با آنکه در نگاهت

        حرفی برای من نیست

        با آنکه لحظه لحظه میخوانم از دو چشمت

        تن خسته ای ز تکرار
      `,
      singrName: 'معین',
      category: 'غمگین',
      releaseDate: '۲۸  ⁄  ۶  ⁄  ۱۳۶۸'
    },
  ];

  const uniqueCategories = Array.from(
    new Map(musicdata.map(item => [item.category, item.category]))
  );

  return (
    <GlobalContext.Provider value={{ musicdata, uniqueCategories, value, setvalue }}>
      {children}
    </GlobalContext.Provider>
  );
}

export function useGlobal() {
  return useContext(GlobalContext);
}